In [75]:
import numpy as np
import pandas as pd

**Задание 1**
Создайте numpy array с элементами от числа N до 0 (например, для N = 10 это будет array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0])).

In [48]:
n = 10
a = np.arange((n-1), 0, -1)

**Задание 2**
Создайте диагональную матрицу с элементами от N до 0. Посчитайте сумму ее значений на диагонали.

In [51]:
np.diag(a, k=0)

array([[9, 0, 0, 0, 0, 0, 0, 0, 0],
       [0, 8, 0, 0, 0, 0, 0, 0, 0],
       [0, 0, 7, 0, 0, 0, 0, 0, 0],
       [0, 0, 0, 6, 0, 0, 0, 0, 0],
       [0, 0, 0, 0, 5, 0, 0, 0, 0],
       [0, 0, 0, 0, 0, 4, 0, 0, 0],
       [0, 0, 0, 0, 0, 0, 3, 0, 0],
       [0, 0, 0, 0, 0, 0, 0, 2, 0],
       [0, 0, 0, 0, 0, 0, 0, 0, 1]])

In [52]:
np.diag(a, k=0).sum()

45

**Задание 3**

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [156]:
# pd.read_html( 'http://files.grouplens.org/datasets/movielens/ml-latest-small.zip')

ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [160]:
ratings['movieId'].value_counts().head(1)

356    329
Name: movieId, dtype: int64

**Задание 4**

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [134]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [146]:
filtered_countries = data[ (data['country'] == 'Lithuania') | (data['country']=='Latvia') | (data['country']=='Estonia')]
filtered_year =  filtered_countries[(filtered_countries['year'] >= 2005) & (filtered_countries['year'] <= 2010)]
filtered_category = filtered_year[(filtered_year['category'] == 4)| (filtered_year['category'] == 12) | (filtered_year['category'] == 21)]
filtered_quantity = filtered_category[filtered_category['quantity'] >= 0]
filtered_quantity.head(10)

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11157  Lithuania  2007       0.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4
12755    Estonia  2008       1.0         4
12756    Estonia  2007       0.0         4

In [149]:
# f1 = data[data['country'].apply(lambda x: x in ['Lithuania', 'Latvia', 'Estonia'])]
# f2 = f1[f1['category'].apply(lambda x: x in [4, 12, 21])]
# f3 = f2[f2['year'].apply(lambda x: x >= 2005 and x <= 2010)]
# f3[f3['quantity'].apply(lambda x: x >= 0)].head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

**Задание 5**

Решите систему уравнений:

4x + 2y + z = 4

x + 3y = 12

5y + 4z = -3

In [58]:
# коэффициенты при переменных в левой части уравнения
a = np.array( [ [4, 2, 1], [1, 3, 0], [0, 5, 4] ] )

In [59]:
# значения в правой части уравнения
b = np.array( [4, 12, -3] )

In [60]:
# решение
from numpy import linalg

In [61]:
linalg.solve(a, b)

array([ 0.46666667,  3.84444444, -5.55555556])

In [62]:
# проверка верности

np.allclose( np.dot(a, linalg.solve(a, b)), b )

True